tap "homebrew/services"
tap "homebrew/cask"
tap "wata727/tflint"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

#CLI apps
brew "ack"
brew "fortune"
brew "cowsay"
brew "awscli"
brew "bat"
brew "git"
brew "git-extras"
brew "go"
brew "jq"
brew "jsonpp"
brew "neovim"
brew "nvm"
brew "python3"
brew "sqlite"
brew "terraform"
brew "tflint"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "bash-completion"
cask "dotnet-sdk"
brew "tree"
tap "eddieantonio/eddieantonio" #for Brewcat
brew "imgcat"
brew "exercism"
brew "lolcat"
brew "postgresql"
brew "graphviz"
cask "powershell"
brew "autojump"
brew "git-lfs"
brew "hub"
brew "git-delta"

#Docker
cask "docker"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-completion"

#GUI apps
cask "intellij-idea"
cask "visual-studio-code"
cask "slack"
cask "google-chrome"
cask "firefox-nightly"
cask "tor-browser"
cask "spotify"
cask "iterm2"
cask "alfred"
cask "postman"
cask "macpass"
cask "GIMP"
cask "rider"

#Fonts (require SVN)
brew "svn"
cask "font-fontawesome"
cask "font-awesome-terminal-fonts"
cask "font-hack"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-input"
